Revit 2024 API
ParameterTypeId Class
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class ParameterTypeId
Visual Basic
Public NotInheritable Class ParameterTypeId
Visual C++
public ref class ParameterTypeId abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ParameterTypeId
See Also
ParameterTypeId Members
Autodesk.Revit.DB Namespace